Table of Contents
 Interface IIdeaFoldedPlate
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Represent folded plate - connect IIdeaPlate and IIdeaBend in to one piece
public interface IIdeaFoldedPlate : IIdeaObjectConnectable, IIdeaPersistentObject, IIdeaObject
Inherited Members
 IIdeaPersistentObject.Token
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 Bends
Collection of plates
IEnumerable<IIdeaBend> Bends { get; }
Property Value
IEnumerable<IIdeaBend>
 Plates
Collection of plates
IEnumerable<IIdeaPlate> Plates { get; }
Property Value
IEnumerable<IIdeaPlate>
 Edit this page